app/views/menus/index.html.erb

SELECT "menus".* FROM "menus" WHERE (created_at >= '2016-08-06')
---
  </tr>
    <% Menu.where("created_at >= :today", {today: Date.today}).each do |menu| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
          <%end%>
          <%= ord.user.first_name %>