app/views/orders/edit.html.erb

<h1>Editing order</h1>
<p><%= @order.user.first_name %> <%= @order.user.last_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 14]]