app/views/orders/new.html.erb

	    <%= form_for @order do |f| %>
	 			<%= f.collection_select :menu_id, Menu.all, :id, :title %>
---
SELECT  "menus".* FROM "menus"  ORDER BY "menus"."id" ASC LIMIT 1