app/views/orders/show.html.erb

<p> <%= @order.user.first_name %> a comandat <%= @order.menu.title %>. Comanda este <%= @order.status %>. </p>
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]