app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus" WHERE (created_at >= '2016-08-06')
SELECT "orders".* FROM "orders"
SELECT "users".* FROM "users"
---
	def index
		@menus = Menu.all
		@orders = Order.all
		@users = User.all

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."menu_id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [[nil, 4]]
---
 	def show
		@menu = Menu.find(params[:id])
		@user = @menu.users
		@order = @menu.orders

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@menu = Menu.find(params[:id])

INSERT INTO "menus" ("title", "d1", "d2", "desert", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdf"], ["d1", "sdfsd"], ["d2", "sdf"], ["desert", "sdf"], ["created_at", "2016-08-02 15:04:22.715905"], ["updated_at", "2016-08-02 15:04:22.715905"]]
---
  def create
  	@menu = Menu.new(menu_params)
	  if @menu.save

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "menus" SET "title" = ?, "updated_at" = ? WHERE "menus"."id" = ?  [["title", "sdfsdfsdgsd"], ["updated_at", "2016-08-02 15:16:23.943999"], ["id", 1]]
---
	def update
  @menu = Menu.find(params[:id])

	  if @menu.update(menu_params)

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "menus" WHERE "menus"."id" = ?  [["id", 1]]
---
 def destroy
    @menu = Menu.find(params[:id])
    @menu.destroy