app/controllers/orders_controller.rb

	def create
  	@order = Order.new(order_params)
	  if @order.save
---
INSERT INTO "orders" ("status", "user_id", "menu_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["status", "0"], ["user_id", 14], ["menu_id", 4], ["created_at", "2016-08-05 12:34:34.509490"], ["updated_at", "2016-08-05 12:34:34.509490"]]

	def update
  @order = Order.find(params[:id])
	@menu = @order.menu
	  if @order.update(order_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 21]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "livrata"], ["updated_at", "2016-08-05 13:02:34.657430"], ["id", 21]]