app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "phone", "address", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
	@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Oana"], ["last_name", "Cojocaru"], ["password_digest", "$2a$10$W6zq5UwZrz0fzeBOqLNoau4VHIp3qhpjaHW1LDffOovoSuJ6Lw91S"], ["updated_at", "2016-08-07 15:58:44.544641"], ["id", 1]]
---
	def update
  @user = User.find(params[:id])
	  if @user.update(user_params)